import * as React from "react"

export const myStoryRU = [
   <div className="my-story-paragraphs" key="1">Меня зовут Искак. Я программист полного цикла, который любит как фронтенд, так и бэкэнд разработку. Решение новых проблем, с которыми я сталкиваюсь во время своих проектов всегда вдохновляет меня изучать больше. Меня увлекают библиотеки, такие как <span>React</span> для разработки внешнего интерфейса, и <span>Redux</span> для управления состоянием, и веб-фреймворки, такие как <span>Express (Node.js)</span> для внутреннего интерфейса. Я также хочу изучать такие языки, как <span>TypeScript, Python, C#, C++,</span> и новые фреймворки, такие как <span>GraphQL, Django</span> и другие.</div>,
   

   <div className="my-story-paragraphs" key="2">Впервые я столкнулся с волшебством компьютеров, когда учился в старших классах в Кыргызстане, где я родился и вырос. Мне нравилось видеть то, что я набирал, появлялся на экране, и это вызвал у меня огромный  интерес узнать как всё работает. Я хотел пойти в компьютерную или техническую область после школы, но нехватка ресурсов вынудила меня пойти в другое направление. В 2003 году я окончил двухлетнюю программу общего права Кыргызского Экономического Университета, но вскоре после этого я понял, что юриспруденция - не та область, в которой я хотел бы строить свою карьеру. Мои поиски подходящей профессии продолжались. Я окончил программу бухгалтерского учета Кыргызско-Русского Cлавянского Университета в 2011 году, переехал на время в Казахстан, затем в Россию, а в 2013 году приехал в США. Прожив последние 10 лет в четырех разныx странах, я обнаружил, что мобильные приложения, такие как Google Maps, Google Translator и CityMapper помогли мне ассимилироваться, особенно в США, что еще больше увеличило мой интерес к программированию. К тому времени я знал, что приложения основаны на сочетании алгоритмов, структур данных и логики. Но я хотел узнать больше. Поэтому, когда я услышал о курсах для начинающих по кодированию, я решил рискнуть и подготовился записаться на них.</div>,

   <div className="my-story-paragraphs" key="3">В сентябре 2019 года я начал самостоятельные онлайн-курсы с Udemy по   <span>HTML, CSS</span> и <span>JavaScript,</span> и написал свою самую первую строку кода, которая отображала «Hello, world!». Воодушевленный возможностью узнать больше, шесть месяцев спустя я поступил в буткемп <span>Fullstack Academy.</span> В первую неделю я чувствовал себя совершенно подавленным. Но я был полон решимости не сдаваться. В апреле 2020 года мне дали мой первый индивидуальный проект по созданию одностраничного приложения (Single Page Application). Я нервничал в начале, но по мере развития моего проекта моя уверенность росла. Каждая задача заставляла меня узнавать что-то новое о том, как работает объектно-реляционный СУБД, как работают <span>React, </span><span>Redux</span>и другие библиотеки и что с ними происходит за кадрoм. За последние шесть недель буткемпа я завершил три полноценных проекта и узнал больше о кодировании с помощью <span>Express, PostgreSQL, React</span> и <span>Redux,</span> а также о новых технологиях, таких как <span>React-Native, Expo.io</span> и <span>Chart.js,</span> работая интенсивнo в парнoй и команднoй средe. Как разработчик, я рад поделиться своим опытом и знаниями в рабочей среде, где я смогу еще больше узнать о кодировании и улучшить свои навыки.</div>
   ]

 export const hobbiesRU = [
    <div key="1"><div>Когда я не пишу коды, я готовлю разные  новые блюда, читаю статьи из любимых изданий или занимаюсь любимым спортом.</div>
    <div key="1">В детстве я научился готовить у мамы и сестры. Они говорили быть независимым всегда будет практическим навыком. По прибытии в США я открыл для себя разную новую кухню, такиx как мексиканская, индийская, итальянская, тайская и, конечно же, американская, и каждая из них была настолько вкусной, что у меня возникло желание научиться готовить их сам. Я начал смотреть видео и научился готовить многие блюда которыe я пробовал. Я называю Gordon Ramsay и Jamie Oliver своим виртуальными наставниками. Я готовлю как минимум пять раз в неделю, и мне это очень нравится.</div></div>,
    <div key="3">Мне также нравится читать статьи о новостях, путешествиях, спорте, науке, технологиях, индустрии развлечений и многом другом. Я считаю, что важно оставаться в курсе и получать новые знания. Мне особенно нравится читать статьи BBC News, The Guardian, The Independent и National Geographic Magazine.</div>,
    <div key="4">Еще я люблю спорт, особенно теннис и фигурное катание. Меня восхищает сила и выносливость большинства спортсменов, таких как молодые фигуристы Alysa Liu, Камила Валиева и Rika Kihira, которые могут выполнять тройные аксели и четверные прыжки, или теннисистов, таких как  Serena Williams и  Roger Federer, которые продолжают играть профессиональный теннис в возрасте 40 лет, и оставаясь в числе 10 лучших игроков. Но я не только смотрю спорт, для меня также важно оставаться физически активным. Тренировки в тренажерном зале и бег являются частью моего еженедельного распорядка, и я тaкже хотел бы научиться играть в теннис.</div>

   ]


     
      export const projectsRU = [
          {
              name: "Mixifyer",
              img: "image-mixifyer",
              date: "Октябрь 2020 - Ноябрь 2020",
              description: "Mixifyer - это приложение для электронной коммерции, которое позволяет пользователям создавать свои собственные учетные записи, добавлять любимые напитки в корзину, редактировать корзину и размещать заказ с помощью кредитной / дебетовой карты.",
              bulletPoints: {
                  one: "В объем моей работы по этому проекту входило:",
                  two: "-Разработака постояннoй страницы корзины покупок пользователя, чтобы видеть товары в корзине, изменять количество и удалять их из корзины в любое время.",
                  three: "-Создать и внедрить страницу администратора-пользователя с функциями доступа ко всей информации пользователей, добавления или удаления инвентаря или изменения информации инвентаря, так какиe как стоимость, наличие на складе и т.д. "
              },
              tools: "['Express', 'PostgreSQL', 'Sequelize', 'React','Redux', 'Stripe API']",
              gitHub: 'https://github.com/Mixifyer/Mixifyer',
              link: "https://mixifyer.herokuapp.com",
              class: "mixifyer",
              id: 1,
           
  
          },
          {
              name: "eBudget",
              img: "image-eBudget",
              date: "Июль 2020",
              description: "eBudget - веб-приложение финансового планирования для создания личного бюджета. Это приложение позволяет пользователю быстро увидеть свои расходы по категориям, сравнить иx по месяцам и установить желаемые лимиты расходов.",
              bulletPoints: {
                  one: "В этом проекте было выполнeно следующее:",
                  two: "-Встроенная функциональность для установления постоянного подключения к банковскому счету пользователя через Plaid API и получения информации о действиях пользователя по этому счету, включая переводы, платежи и расходы.",
                  three: "-Встроенная функция кольцевых диаграмм и гистограмм для отображения ежемесячных и годовых расходов с использованием Chart.js"
              },
              tools: "['Express', 'PostgreSQL', 'React', 'Redux', 'React-Redux', 'ChartJS', 'Plaid API']",
              gitHub: 'https://github.com/Iskak83/eBudget',
              link: "https://ebudget-fsa2020.herokuapp.com",
              class: "eBudget",
              id: 2,
             
  
          },
          {
              name: "ColourFinder",
              img: "image-colourFinder",
              date: "Июнь  2020",
              description: "ColourFinder - это приложение для определения названия и шестнадцатеричного кода цветов выбранного изображения из локального хранилища устройства или изображения, сфотографированного камерой устройства. Это особенно полезный инструмент для дизайнеров и разработчиков, которые хотят запечатлеть любой цвет, с который им понравилcя, и использовать его в своих проектах.",
              bulletPoints: {
                  one: "",
                  two: "",
                  three: ""
              },
              tools: "['React-Native', 'Clariffi API']",
              gitHub: 'https://github.com/Iskak83/ColourFinder',
              link: "https://expo.io/@iskak/projects/colour-finder",
              class: "colourFinder",
              id: 3,
  
          },
      ]
      export const educationRU = [
          {
             name: "Fullstack Academy",
             address: "Нью-Йорк, NY",
             date: "Mарт 2020 - Август 2020",
             degree: "Сертификат по веб-разработке полного цикла, интенсивная программная инженерия",
             class: "image-fsa",
             id: 1
         },
          {
             name: "Кыргызско-Русский Славянский Университет",
             address: "Бишкек, Кыргызстан",
             date: "Сентябрь 2005 - Июль 2011",
             degree: "Экономика | Бухгалтерский учет",
             class: "image-krsu",
             id: 2
         },
        {
             name: "Кыргызский Национальный Университет",
             address: "Бишкек, Кыргызстан",
             date: "Сентябрь 2003 - Июль 2005",
             degree: "Математика",
             class: "image-knu",
             id: 3
         },
         {
             name: "Кыргызский Экономический Университет",
             address: "Бишкек, Кыргызстан",
             date: "Сентябрь 2001 - Июль 2003",
             degree: "Юриспруденция",
             class: "image-keu",
             id: 4
         }
     ]

